--[[
|---------------------------------------------------------------------------------|
| This Project Powered by : @sudo_tokhs_telegram   Version 1.2 Anti Spam Cli Bot  |
|---------------------------------------------------------------------------------|
]]
do

function run(msg, matches)
  return [[ 
💠راهنما💠
🔆شخصی سازی سوپرگروه:🔆
💭قفل
(لینک-مخاطب-اسپم-فارسی-اعضا-راستچین-اعلان-استیکر-تگ-شکلک-انگلیسی-فروارد-کلمات زشت-وب لینک)
🗯بازکردن
(لینک-مخاطب-اسپم-فارسی-اعضا-راستچین-اعلان-استیکر-تگ-شکلک-انگلیسی-فروارد-کلمات زشت-وب لینک)

📉ممنوعیت
(صدا-فیلم-عکس-گیف-متن-همه)
📈حذف ممنوعیت
(صدا-فیلم-عکس-گیف-متن-همه)

📝تنظیم
(عکس-اسم-درباره-قوانین-نام کاربری-حساسیت)

🚩عمومی (🔓-🔐)

💥مدیریت یک کاربر💥:
🚫بلاک (ایدی یا ریپلای)
🚫اخراج (ایدی یا ریپلای)
🚫بن (ایدی یا ریپلای)

⭕️انبن (ایدی یا ریپلای)

📍تنظیم مالک (ایدی یا ریپلای)
📍تنطیم ادمین (ایدی یا ریپلای)
📍ارتقا (ایدی یا ریپلای)

🔻عزل (ایدی یا ریپلای)
🔻عزل ادمین (ایدی یا ریپلای)

📵خفه کردن (ایدی یا ریپلای)
(اگر برای دوبار پیاپی زده شود فرد ازادمیشود)

📚دستورات عمومی سوپر گروه:📚
▫️لیست
(اعضا-خفه ها-ممنوعیت-مدیران)
▪️ادمین ها
▫️مالک
▪️ربات ها

🔹تنظیمات
🔸اطلاعات گروه

🔻قوانین

♦️حذف (ریپلای)
♦️اخراجم کن

🌀اطلاعات (ایدی)
🌀ایدی (ریپلای یا ایدی)

🔏تنظیم لینک
🏳لینک
〰〰〰〰〰〰〰
☑️v 1.2
💠 تیم بیست گروه💠
]]
end

return {
  patterns = {
    "^راهنما$"
  }, 
  run = run 
}

end
